/*============================================================================*/
/*  版权声明 : Copyright (c) 1998-2008 中兴通讯股份有限公司传输北京软件开发部 */
/*  系统名称 : ZXONE 8600光传输系统                                           */
/*  文 件 名 : DBConPool.h                                                    */
/*  功能描述 :                                                                */
/*  创 建 人 : 胡永福                                                         */
/*  文件版本 : V1.00.001                                                      */
/*  创建日期 : 2014.11.24                                                     */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期         版本            修改人          修改摘要                     */
/*============================================================================*/
#ifndef _DBCONPOOL_H
#define _DBCONPOOL_H

/*============================================================================*/
/* 包含的标准库或者其他非标准库头文件                                         */
/*============================================================================*/

/*============================================================================*/
/* 常量定义                                                                   */
/*============================================================================*/

/*============================================================================*/
/* 全局宏                                                                     */
/*============================================================================*/
#define DB_CONNECT_NUM_MAX      1000

#define DB_POOL_HANDLE_FREE     0
#define DB_POOL_HANDLE_BUSY     1
/*============================================================================*/
/* 全局数据类型                                                               */
/*============================================================================*/
typedef struct
{
    MYSQL *DbConnHandle;
    UINT32 Status;
}TDBConInfo;

/*============================================================================*/
/* 类定义                                                                     */
/*============================================================================*/

/*============================================================================*/
/* 模板(template)(包括C++中的类模板和函数模板)                                */
/*============================================================================*/

/*============================================================================*/
/* 全局函数原型                                                               */
/*============================================================================*/
UINT32 DBConPool_Init(UINT32 PoolSize, 
                      const UINT8 *Hostname,
                      const UINT8 *UserName,
                      const UINT8 *PassWord,
                      const UINT8 *DBName,
                      UINT32 DBPort);

MYSQL *DBConPool_GetConnect(void);

UINT32 DBConPool_ReleaseConnect(MYSQL *pDBConn);

INT32 DBConPool_ExecuteSql(MYSQL *pConHandle, const UINT8 *pSql, MYSQL_RES **pRes);

UINT32 DBConPool_GetRowNum(MYSQL_RES *pRes);

UINT32 DBConPool_GetColNum(MYSQL_RES *pRes);

MYSQL_ROW DBConPool_FetchRow(MYSQL_RES *pRes);

void DBConPool_FreeResult(MYSQL_RES *pRes);

UINT32 DBConPool_Destroy(void);

#endif

