/*============================================================================*/
/*  版权声明 : Copyright (c) 1998-2008 中兴通讯股份有限公司传输北京软件开发部 */
/*  系统名称 : ZXONE 8600光传输系统                                           */
/*  文 件 名 : TDMMMalloc.c                                                   */
/*  功能描述 :                                                                */
/*  创 建 人 : 胡永福                                                         */
/*  文件版本 : V1.00.001                                                      */
/*  创建日期 : 2014.10.23                                                     */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期         版本            修改人          修改摘要                     */
/*============================================================================*/

/*============================================================================*/
/* 包含的标准库或者其他非标准库头文件                                         */
/*============================================================================*/
#include <stdio.h>
#include <string.h>

#include "VarType.h"
#include "ErrorCode.h"
#include "TDMMMalloc.h"
#include "TestDrv.h"
#include "Log.h"
#include "MemoryPool.h"
/*============================================================================*/
/* 本文件使用的常量定义                                                       */
/*============================================================================*/

/*============================================================================*/
/* 本文件使用的宏定义                                                         */
/*============================================================================*/

/*============================================================================*/
/* 本文件使用的数据类型                                                       */
/*============================================================================*/

/*============================================================================*/
/* 全局变量                                                                   */
/*============================================================================*/

/*============================================================================*/
/* 本文件使用的变量                                                           */
/*============================================================================*/

/*============================================================================*/
/* 类的实现                                                                   */
/*============================================================================*/
static void TDMM_Malloc_Init_Case(void *arg);

static void TDMM_Malloc_Case(void *arg);

static void *DMMTestThread(void *arg);

static void TDMM_Free_Case(void *Para);
/*============================================================================*/
/*  函数名 : TThreadPool_AddTestCase                                          */
/*  输  入 : 输入参数或结构的说明                                             */
/*  输  出 : 无                                                               */
/*  返回值 : 执行结果: 0-成功, 非0-失败                                       */
/*  描  述 : 函数功能描述                                                     */
/*  作  者 : 胡永福                                                           */
/*  版  本 : V1.00.001                                                        */
/*  日  期 : 2014.10.23                                                       */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期            版本            修改人          修改摘要                  */
/*============================================================================*/
UINT32 TDMM_Malloc_AddTestCase(void)
{
    TTestCase TestCase[] = 
    {
        {
            "TDMM_Malloc_Init_Case",
            TDMM_Malloc_Init_Case,
            NULL
        },      
        {
            "TDMM_Malloc_Case",
            TDMM_Malloc_Case,
            NULL
        },
#if 0        
        {
            "TDMM_Free_Case",
            TDMM_Free_Case,
            NULL
        },        
#endif        
        {
            "Over",
            NULL,
            NULL
        }
    };
    
    return TD_AddTestCase(TestCase);
}

/*============================================================================*/
/*  函数名 : TThreadPool_Pool_Init_Case                                       */
/*  输  入 : 输入参数或结构的说明                                             */
/*  输  出 : 无                                                               */
/*  返回值 : 执行结果: 0-成功, 非0-失败                                       */
/*  描  述 : 函数功能描述                                                     */
/*  作  者 : 胡永福                                                           */
/*  版  本 : V1.00.001                                                        */
/*  日  期 : 2014.10.23                                                       */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期            版本            修改人          修改摘要                  */
/*============================================================================*/
static void TDMM_Malloc_Case(void *arg)
{   
    return;
}

/*============================================================================*/
/*  函数名 : TThreadPool_pool_add_worker_Case                                 */
/*  输  入 : 输入参数或结构的说明                                             */
/*  输  出 : 无                                                               */
/*  返回值 : 执行结果: 0-成功, 非0-失败                                       */
/*  描  述 : 函数功能描述                                                     */
/*  作  者 : 胡永福                                                           */
/*  版  本 : V1.00.001                                                        */
/*  日  期 : 2014.10.23                                                       */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期            版本            修改人          修改摘要                  */
/*============================================================================*/
static void TDMM_Malloc_Init_Case(void *arg)
{   
    INT32 loop = 0, ret;
    pthread_t pid[TDMM_MALLOC_TEST_THREAD_NUM];
    UINT8 *argv[5];

    argv[0] = (UINT8 *)"dmm";
    argv[1] = (UINT8 *)"8";    
    MemPool_Show(1, argv);        

    for (loop = 0; loop < TDMM_MALLOC_TEST_THREAD_NUM; loop++)
    {
        if ((ret = pthread_create(&pid[loop], NULL, DMMTestThread, NULL)) != 0)
        {
            printf("loop = %d At %s:%d\n",loop, __FILE__, __LINE__);
            perror("");
            
            return;
        }
    }
    
	for (loop = 0; loop < TDMM_MALLOC_TEST_THREAD_NUM; loop++)
	{
		pthread_join(pid[loop], NULL);
    }

    for (loop = 0; loop < 2; loop++)
    {
        sleep(1);
        MemPool_Show(1, argv);
    }
    
    return;
}

/*============================================================================*/
/*  函数名 : DMMTestThread                                                    */
/*  输  入 : 输入参数或结构的说明                                             */
/*  输  出 : 无                                                               */
/*  返回值 : 执行结果: 0-成功, 非0-失败                                       */
/*  描  述 : 函数功能描述                                                     */
/*  作  者 : 胡永福                                                           */
/*  版  本 : V1.00.001                                                        */
/*  日  期 : 2014.10.30                                                       */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期            版本            修改人          修改摘要                  */
/*============================================================================*/
static void *DMMTestThread(void *arg)
{
    void *pMem = NULL;
    UINT32 loop = 100;
    UINT32 memLen = 2;
    
    while (loop--)
    {
        pMem = MemPool_Malloc(memLen);
        if (NULL == pMem)
        {
            printf("Malloc Failed:%s:%d\n", __FILE__, __LINE__);
            continue;
        }

        memset(pMem, 0, memLen);
        
        MemPool_Free(pMem);
        //printf("I am:%d loop:%d\n", pthread_self(), loop);
    }
    
    return;
}

/*============================================================================*/
/*  函数名 : TDMM_Free_Case                                                   */
/*  输  入 : 输入参数或结构的说明                                             */
/*  输  出 : 无                                                               */
/*  返回值 : 执行结果: 0-成功, 非0-失败                                       */
/*  描  述 : 函数功能描述                                                     */
/*  作  者 : 胡永福                                                           */
/*  版  本 : V1.00.001                                                        */
/*  日  期 : 2014.11.5                                                        */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期            版本            修改人          修改摘要                  */
/*============================================================================*/
static void TDMM_Free_Case(void *Para)
{
    MemPool_DestroyMem();

    return;
}
