/*============================================================================*/
/*  版权声明 : Copyright (c) 1998-2008 中兴通讯股份有限公司传输北京软件开发部 */
/*  系统名称 : ZXONE 8600光传输系统                                           */
/*  文 件 名 : ClientCount.h                                                  */
/*  功能描述 :                                                                */
/*  创 建 人 : 胡永福                                                         */
/*  文件版本 : V1.00.001                                                      */
/*  创建日期 : 2014.10.27                                                     */
/*============================================================================*/
/*  修改记录                                                                  */
/*  日期         版本            修改人          修改摘要                     */
/*============================================================================*/
#ifndef _CLIENTCOUNT_H
#define _CLIENTCOUNT_H

/*============================================================================*/
/* 包含的标准库或者其他非标准库头文件                                         */
/*============================================================================*/

/*============================================================================*/
/* 常量定义                                                                   */
/*============================================================================*/

/*============================================================================*/
/* 全局宏                                                                     */
/*============================================================================*/
#define CLIENT_RECORD_MAX_NUM           (1024 * 1024 * 8) /* 千万 */
#define CLIENT_RECORD_NUM_PLUS          0
#define CLIENT_RECORD_NUM_MINUS         1
#define CLIENT_RECORD_DAILY_NUM         (60 * 60 *24)

#define CLIENT_RECORD_OPER_CONNECT      0
#define CLIENT_RECORD_OPER_CLOSE        1
#define CLIENT_RECORD_OPER_WRITE        2

/*============================================================================*/
/* 全局数据类型                                                               */
/*============================================================================*/
typedef struct
{
    UINT32 SecondOfToday;
    INT32 fd;
    INT32 Oper;
}TClientOperationRecord;

/* 以下enum和TClientCount相关联，不能改变结构体成员顺序 */
typedef struct
{
    UINT32 OnlineClientNum;   /* 在线用户数 */
    UINT32 OnlineRequestNum; /* 在线请求操作数 */
}TClientCount;

enum Mutex
{
    ONLINECLIENT_NUM,
    CONNECTEDCLIENT_NUM,
    REQUEST_NUM
};

/*============================================================================*/
/* 类定义                                                                     */
/*============================================================================*/

/*============================================================================*/
/* 模板(template)(包括C++中的类模板和函数模板)                                */
/*============================================================================*/

/*============================================================================*/
/* 全局函数原型                                                               */
/*============================================================================*/
INT32 InitClientCount(void);

INT32 AddClientRecord(TClientOperationRecord Record);

void ClientCount(INT32 CountOper);

#endif

